---
lab:
  title: "Exercice\_06\_: repérer les menaces dans Microsoft\_Sentinel"
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## Vue d’ensemble de l’exercice

Vous êtes un analyste des opérations de sécurité travaillant dans une entreprise qui a implémenté Microsoft Sentinel. Vous devez apprendre à détecter et à atténuer les menaces à l’aide de Microsoft Sentinel. Une fois que vous avez connecté vos sources de données à Microsoft Sentinel, créez des règles d’analyse personnalisées pour faciliter la détection des menaces et comportements anormaux au sein de votre environnement.

Les requêtes de repérage des menaces permettent aux analystes SOC de surveiller et d’examiner de manière proactive les attaques potentielles au fur et à mesure qu’elles se développent ou avant qu’elles ne se produisent. Le repérage dans Microsoft Sentinel permet aux requêtes similaires aux règles analytiques d’auditer l’environnement pour détecter les activités potentiellement malveillantes tout en permettant aux analystes d’élever les résultats en tant qu’incidents si nécessaire. Parfois, le repérage des menaces peut nécessiter des données qui dépassent la rétention du niveau analytique (chaud). C’est là que des fonctionnalités telles que les tâches Recherche ou Restauration peuvent être utilisées pour s’assurer que le SOC dispose des données dont il a besoin.

## Instructions de l’exercice

### Tâche 1 : créer une requête de repérage

Dans cette tâche, vous allez créer une requête de repérage et ajouter un signet à un résultat.

1. Connectez-vous à la machine virtuelle WIN1 en tant qu’Administrateur ou Administratrice avec le mot de passe : **Pa55w.rd**.  

1. Dans le navigateur Edge, accédez au portail Azure à l’adresse <https://portal.azure.com>.

1. Dans la boîte de dialogue **Connexion**, copiez et collez le compte de **messagerie du locataire** fourni par l’hébergeur du labo, puis sélectionnez **Suivant**.

1. Dans la boîte de dialogue **Entrer un mot de passe**, copiez et collez le **mot de passe du locataire** fourni par l’hébergeur du labo, puis sélectionnez **Connexion**.

1. Dans la barre de recherche du portail Azure, tapez *Sentinel*, puis sélectionnez **Microsoft Sentinel**.

1. Sélectionnez votre espace de travail Microsoft Sentinel.

1. Sélectionnez **Journaux**.

1. Entrez l’instruction KQL suivante dans l’espace *Nouvelle requête 1* :

   >**Important :** collez d’abord toutes les requêtes KQL dans le Bloc-notes pour éviter toute erreur, puis copiez-les dans la fenêtre du journal *Requête 1*.

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
